app/controllers/book_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @book = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bookposts".* FROM "bookposts" WHERE "bookposts"."book_id" = ?  ORDER BY "bookposts"."tag" ASC  [["book_id", 2]]
SELECT "posts".* FROM "posts" WHERE "posts"."book_id" = ?  ORDER BY "posts"."tag" ASC  [["book_id", 1]]
---
  def show
    @book = Book.find(params[:id])
    @bookposts = @book.bookposts.order(:tag)