app/controllers/bookpost_controller.rb

  def show
  	book = Book.find params[:book_id]
  	@bookpost = Bookpost.find(params[:id])
  	@bookposts = book.bookposts.order(:tag)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "bookposts".* FROM "bookposts" WHERE "bookposts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bookposts".* FROM "bookposts" WHERE "bookposts"."book_id" = ?  ORDER BY "bookposts"."tag" ASC  [["book_id", 2]]