app/controllers/category_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  ORDER BY "posts"."tag" ASC  [["category_id", 1]]
---
  def show
    @category = Category.find(params[:id])
    @posts = @category.posts.order(:tag)