app/controllers/post_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? AND "posts"."id" = ?  ORDER BY "posts"."tag" ASC LIMIT 1  [["category_id", 1], ["id", 1]]
---
  def show
  	category = Category.find params[:category_id]
  	@posts = category.posts.order(:tag)